





Network Working Group				       Robert Siemborski
INTERNET-DRAFT				      Carnegie Mellon University
Intended Category: Standards Track			   October, 2003


	    IMAP Extension for SASL Initial Client Response
	  <draft-siemborski-imap-sasl-initial-response-00.txt>


Status of this Memo
    This document is an Internet-Draft and is in full conformance with
    all provisions of Section 10 of RFC2026.

    Internet-Drafts are working documents of the Internet Task Force
    (IETF), its areas, and its working groups.	Note that other groups
    may also distribute working documents as Internet-Drafts.

    Internet-Drafts are draft documents valid for a maximum of six
    months and may be updated, replaced, or obsoleted by other documents
    at any time.  It is inappropriate to use Internet Drafts as
    reference material or to cite them other than as "work in progress."

    The list of current Internet-Drafts can be accessed at
    http://www.ietf.org/ietf/1id-abstracts.txt

    The list of Internet-Draft Shadow Directories can be accessed at
    http://www.ietf.org/shadow.html.

    Distribution of this memo is unlimited.

Abstract

    To date, the Internet Message Access Protocol (IMAP) has used a
    Simple Authentication and Security Layer (SASL) profile which always
    required at least one complete round trip for an authentication, as
    it did not support an initial client response argument.  This
    additional round trip at the beginning of the session is
    undesirable, especially when round trip costs are high.

    This document defines an extension to IMAP which allows clients and
    servers to avoid this round trip by allowing an initial client
    response argument to the IMAP AUTHENTICATE command.

1.  How to Read This Document

    The key words "MUST, "MUST NOT", "REQUIRED", "SHOULD", "SHOULD NOT",
    "RECOMMENDED", and "MAY" in this document are to be interpreted as
    defined in "Key words for use in RFCs to Indicate Requirement



Siemborski		   Expires April, 2004		        [Page 1]





IMAP Extension for SASL Initial Client Response		   October, 2003


Table of Contents


1. How to Read This Document . . . . . . . . . . . . . . . . . . . .   1
2. Introduction	 . . . . . . . . . . . . . . . . . . . . . . . . . .   3
3. Changes to the IMAP AUTHENTICATE Command  . . . . . . . . . . . .   3
4. Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . . . .   4
5. Security Considerations . . . . . . . . . . . . . . . . . . . . .   4
6. Intellectual Property Rights	 . . . . . . . . . . . . . . . . . .   5
7. Copyright . . . . . . . . . . . . . . . . . . . . . . . . . . . .   5
8. References  . . . . . . . . . . . . . . . . . . . . . . . . . . .   6
9. Author's Address  . . . . . . . . . . . . . . . . . . . . . . . .   6
10. Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . .   7






































Siemborski		   Expires April, 2004		        [Page 2]





IMAP Extension for SASL Initial Client Response		   October, 2003


    Levels" [KEYWORDS]

    In examples, "C:" and "S:" indicate lines sent by the client and
    server respectively.

    Formal syntax is defined using [ABNF] as modified by [IMAP4].

2.  Introduction

    The [SASL] initial client response extension is present in any
    [IMAP4] server implementation which returns "SASL" as one of the
    supported capabilities in its CAPABILITY response.

    Servers which support this extension will accept an optional initial
    client response with the AUTHENTICATE command for any [SASL]
    mechanisms which support it.  Clients which support this extension
    SHOULD make use of the initial response whenever they attempt to
    authenticate using a SASL mechanism which supports it.

3.  IMAP Changes to the IMAP AUTHENTICATE Command

    This extension adds an optional second argument to the AUTHENTICATE
    command that is defined in Section 6.2.2 of [IMAP4].  If this second
    argument is present, it represents the contents of the "initial
    client response" defined in section 5.1 of [SASL].

    As with any other client response, this initial client response MUST
    be [BASE64] encoded.  It also MUST be transmitted outside of a
    quoted string or literal.  If the client needs to transmit an
    initial response which is a zero-length string, it MUST transmit a
    single equals sign ("=").  This indicates that the response is
    present, but is a zero-length string.

    If the mechanism chosen by the client does not support an initial
    client response, the server MUST fail the authentication with a
    tagged NO response.	 If the server cannot decode the [BASE64] data
    transmitted by the client, the server MUST fail the authentication
    with a tagged BAD response.	 In particular, the server MUST reject
    (and not ignore) any characters not explicitly allowed by the BASE64
    alphabet, and should reject any sequence of BASE64 characters that
    contains the pad character ('=') anywhere other than the end of the
    string (e.g. "=AAA" and "AAA=BBB" are not allowed).

    Note: support and use of the initial client response is optional for
    both clients and servers.  Servers which implement this extension
    MUST support clients which omit the initial client response, and
    clients which implement this extension MUST NOT send an initial
    client response to servers which do not advertise the SASL



Siemborski		   Expires April, 2004		        [Page 3]





IMAP Extension for SASL Initial Client Response		   October, 2003


    capability.	 If either the client or the server do not support the
    SASL capability, a mechanism which uses an initial client response
    is negotiated using the challenge/response exchange described in
    [IMAP4], with an initial zero-length server challenge.

    The following is an example authentication using the [PLAIN] SASL
    mechanism (under a [TLS] protection layer) and an initial client
    response:

      ... client connects to server and negotiates a TLS protection layer ...
     C: C01 CAPABILITY
     S: * CAPABILITY IMAP4 IMAP4rev1 SASL AUTH=PLAIN
     C: A01 AUTHENTICATE PLAIN dGVzdAB0ZXN0AHRlc3Q=
     S: A01 OK Success (tls protection)

    Note that even when a server supports this extension, the following
    negotiation (which does not use the initial response) is still valid
    and MUST be supported by the server:

      ... client connects to server and negotiates a TLS protection layer ...
     C: C01 CAPABILITY
     S: * CAPABILITY IMAP4 IMAP4rev1 SASL AUTH=PLAIN
     C: A01 AUTHENTICATE PLAIN
      (note that there is a space following the "+" in the following line)
     S: +
     C: dGVzdAB0ZXN0AHRlc3Q=
     S: A01 OK Success (tls protection)

    Clients which support this extension MUST fall back to an [IMAP4]
    compatible mode when they encounter a server which does not
    advertise this extension.

4.  Formal Syntax

    The following syntax specification uses the Augmented Bakus-Naur
    Form [ABNF] notation.  Non-terminals referenced but not defined
    below are as defined by [IMAP4].

     capability	   =/ "SASL"

     authenticate  = "AUTHENTICATE" SP auth-type [SP base64] *(CRLF base64)
		       ;;redefine AUTHENTICATE command defined in [IMAP4]


5.  Security Considerations

    The extension defined in this document is subject to many of the
    Security Considerations defined in [IMAP4] and [SASL].



Siemborski		   Expires April, 2004		        [Page 4]





IMAP Extension for SASL Initial Client Response		   October, 2003


    Server implementations MUST treat the omission of an initial client
    response from the AUTHENTICATE command as defined by [IMAP4] (as if
    this extention did not exist).

    Although [IMAP4] has no express line length limitations, some
    implementations choose to enforce them anyway.  Such implementations
    MUST be aware that the addition of the initial response parameter to
    AUTHENTICATE may increase the maximum line length that IMAP parsers
    may expect to support.  Server implementations MUST be able to
    receive the largest possible initial client response that their
    supported mechanisms might receive.

6.  Intellectual Property Rights

    The IETF takes no position regarding the validity or scope of any
    intellectual property or other rights that might be claimed to
    pertain to the implementation or use of the technology described in
    this document or the extent to which any license under such rights
    might or might not be available; neither does it represent that it
    has made any effort to identify any such rights.  Information on the
    IETF's procedures with respect to rights in standards-track and
    standards-related documentation can be found in BCP-11.  Copies of
    claims of rights made available for publication and any assurances
    of licenses to be made available, or the result of an attempt made
    to obtain a general license or permission for the use of such
    proprietary rights by implementors or users of this specification
    can be obtained from the IETF Secretariat.

    The IETF invites any interested party to bring to its attention any
    copyrights, patents or patent applications, or other proprietary
    rights which may cover technology that may be required to practice
    this standard.  Please address the information to the IETF Executive
    Director.

7.  Copyright

    Copyright (C) The Internet Society (2003). All Rights Reserved.

    This document and translations of it may be copied and furnished to
    others, and derivative works that comment on or otherwise explain it
    or assist in its implementation may be prepared, copied, published
    and distributed, in whole or in part, without restriction of any
    kind, provided that the above copyright notice and this paragraph
    are included on all such copies and derivative works.  However, this
    document itself may not be modified in any way, such as by removing
    the copyright notice or references to the Internet Society or other
    Internet organizations, except as needed for the  purpose of
    developing Internet standards in which case the procedures for



Siemborski		   Expires April, 2004		        [Page 5]





IMAP Extension for SASL Initial Client Response		   October, 2003


    copyrights defined in the Internet Standards process must be
    followed, or as required to translate it into languages other than
    English.

    This document and the information contained herein is provided on an
    "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
    TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
    BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
    HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
    MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


8.  References

     The following documents contain normative definitions or
specifications that are necessary for correct understanding of this
protocol:

[ABNF]	    Crocker, D., "Augmented BNF for Syntax Specifications:
	    ABNF", RFC 2234, November, 1997.

[BASE64]    Josefsson, S., "The Base16, Base32, and Base64 Data
	    Encodings", RFC 3548, July 2003.

[IMAP4]	    Crispin, M., "INTERNET MESSAGE ACCESS PROTOCOL - VERSION
	    4rev1", RFC 3501, March 2003.

[KEYWORDS]  Bradner, S., "Key words for use in RFCs to Indicate
	    Requirement Levels", BCP 14, RFC 2119, March 1997.

[SASL]	    Myers, J., "Simple Authentication and Security Layer
	    (SASL)", RFC 2222, October 1997.

The following references are for informational purposes only:

[PLAIN]	    Newman, C. "Using TLS with IMAP, POP3, and ACAP", RFC 2595,
	    June 1999.

[TLS]	    Dierks, T. and C. Allen, "The TLS Protocol Version 1.0", RFC
	    2246, January 1999.











Siemborski		   Expires April, 2004		        [Page 6]





IMAP Extension for SASL Initial Client Response		   October, 2003


9.  Author's	Address:

    Robert Siemborski
    Carnegie Mellon, Andrew Systems Group
    Cyert Hall 207
    5000 Forbes Avenue
    Pittsburgh, PA  15213
    +1 412 268 7456
    rjs3+@andrew.cmu.edu

10.  Acknowledgments:

    The author would like to acknowledge the contributions of Ken
    Murchison and Mark Crispin and their assistance in reviewing this
    document.

    Alexey Melnikov and Cyrus Daboo also had some early discussions
    about this extension

































Siemborski		   Expires April, 2004		        [Page 7]


